{"_id":{"$oid":"63d1bf190a55cd1085fd785a"},"Title":"Jackie Brown","Summary":"When flight attendant Jackie Brown (Pam Grier) is busted smuggling money for her arms dealer boss, Ordell Robbie (Samuel L. Jackson), agent Ray Nicolette (Michael Keaton) and detective Mark Dargus (Michael Bowen) want her help to bring down Robbie. Facing jail time for her silence or death for her cooperation, Brown decides instead to double-cross both parties and make off with the smuggled money. Meanwhile, she enlists the help of bondsman Max Cherry (Robert Forster), a man who loves her.","filmPosterImg":"image.png","Director":{"$oid":"63d1a05f0a55cd1085fd7850"},"Genres":[{"$oid":"63d19b900a55cd1085fd7847"},{"$oid":"63d19c650a55cd1085fd7848"}]}
{"_id":{"$oid":"63d1c7870a55cd1085fd785b"},"Title":"Goodfellas","Summary":"A young man grows up in the mob and works very hard to advance himself through the ranks. He enjoys his life of money and luxury, but is oblivious to the horror that he causes. A drug addiction and a few mistakes ultimately unravel his climb to the top. Based on the book 'Wiseguy' by Nicholas Pileggi.","filmPosterImg":"image.png","Director":{"$oid":"63d1a05f0a55cd1085fd7852"},"Genres":[{"$oid":"63d19c650a55cd1085fd7848"},{"$oid":"63d19b900a55cd1085fd7846"},{"$oid":"63d19b900a55cd1085fd7847"}]}
{"_id":{"$oid":"63d1c99a0a55cd1085fd785c"},"Title":"Casino","Summary":"In early-1970s Las Vegas, low-level mobster Sam \"Ace\" Rothstein (Robert De Niro) gets tapped by his bosses to head the Tangiers Casino. At first, he's a great success in the job, but over the years, problems with his loose-cannon enforcer Nicky Santoro (Joe Pesci), his ex-hustler wife Ginger (Sharon Stone), her con-artist ex Lester Diamond (James Woods) and a handful of corrupt politicians put Sam in ever-increasing danger. Martin Scorsese directs this adaptation of Nicholas Pileggi's book.","filmPosterImg":"image.png","Director":{"$oid":"63d1a05f0a55cd1085fd7852"},"Genres":[{"$oid":"63d19c650a55cd1085fd7848"},{"$oid":"63d19b900a55cd1085fd7847"}]}
{"_id":{"$oid":"63d1cc210a55cd1085fd785d"},"Title":"Casino","Summary":"In early-1970s Las Vegas, low-level mobster Sam \"Ace\" Rothstein (Robert De Niro) gets tapped by his bosses to head the Tangiers Casino. At first, he's a great success in the job, but over the years, problems with his loose-cannon enforcer Nicky Santoro (Joe Pesci), his ex-hustler wife Ginger (Sharon Stone), her con-artist ex Lester Diamond (James Woods) and a handful of corrupt politicians put Sam in ever-increasing danger. Martin Scorsese directs this adaptation of Nicholas Pileggi's book.","filmPosterImg":"image.png","Director":{"$oid":"63d1a05f0a55cd1085fd7852"},"Genres":[{"$oid":"63d19c650a55cd1085fd7848"},{"$oid":"63d19b900a55cd1085fd7847"}],"Description":"This movie is a duplicate and needs to be erased."}
{"_id":{"$oid":"63d1cc210a55cd1085fd785e"},"Title":"Punch Drunk Love","Summary":"Although susceptible to violent outbursts, bathroom supply business owner Barry Egan (Adam Sandler) is a timid and shy man by disposition, leading a lonely, uneventful life -- partly due to the constant berating he suffers from his seven sisters. However, several events transpire that shake up Egan's mundane existence, one of which is falling in love with one sister's co-worker, Lena Leonard (Emily Watson). But the romance is threatened when Egan falls victim to an extortionist.","Director":{"$oid":"63d1a05f0a55cd1085fd7851"},"Genres":[{"$oid":"63d19da60a55cd1085fd784f"},{"$oid":"63d19b900a55cd1085fd7847"}]}
{"_id":{"$oid":"63d1cc210a55cd1085fd785f"},"Title":"Magnolia","Summary":"On one random day in the San Fernando Valley, a dying father, a young wife, a male caretaker, a famous lost son, a police officer in love, a boy genius, an ex-boy genius, a game show host and an estranged daughter will each become part of a dazzling multiplicity of plots, but one story.","filmPosterImg":"image.png","Genres":[{"$oid":"63d19b900a55cd1085fd7847"}]}
{"_id":{"$oid":"63d1cd030a55cd1085fd7860"},"Title":"2001: A Space Odyssey","Summary":"An imposing black structure provides a connection between the past and the future in this enigmatic adaptation of a short story by revered sci-fi author Arthur C. Clarke. When Dr. Dave Bowman (Keir Dullea) and other astronauts are sent on a mysterious mission, their ship's computer system, HAL, begins to display increasingly strange behavior, leading up to a tense showdown between man and machine that results in a mind-bending trek through space and time.","filmPosterImg":"image.png","Genres":[{"$oid":"63d19c650a55cd1085fd784a"},{"$oid":"63d19da60a55cd1085fd784f"}],"Director":{"$oid":"63d1a10b0a55cd1085fd7853"}}
{"_id":{"$oid":"63d1cfb40a55cd1085fd7862"},"Title":"True Romance","Summary":"A comic-book nerd and Elvis fanatic Clarence (Christian Slater) and a prostitute named Alabama (Patricia Arquette) fall in love. Clarence breaks the news to her pimp and ends up killing him. He grabs a suitcase of cocaine on his way out thinking it is Alabama's clothing. The two hit the road for California hoping to sell the cocaine, but the mob is soon after them.","filmPosterImg":"image.png","Genres":[{"$oid":"63d19c650a55cd1085fd7848"},{"$oid":"63d19b900a55cd1085fd7847"},{"$oid":"63d19c650a55cd1085fd7849"}],"Director":[{"$oid":"63d1a10b0a55cd1085fd7854"}]}
{"_id":{"$oid":"63d1cfb40a55cd1085fd7863"}}
{"_id":{"$oid":"63d1d477cf84b078575ab0ff"},"Title":"Mulholland Drive","Summary":"A dark-haired woman (Laura Elena Harring) is left amnesiac after a car crash. She wanders the streets of Los Angeles in a daze before taking refuge in an apartment. There she is discovered by Betty (Naomi Watts), a wholesome Midwestern blonde who has come to the City of Angels seeking fame as an actress. Together, the two attempt to solve the mystery of Rita's true identity. The story is set in a dream-like Los Angeles, spoilt neither by traffic jams nor smog.","filmPosterImg":"image.png","Director":{"$oid":"63d1a05f0a55cd1085fd7851"},"Genres":[{"$oid":"63d19d240a55cd1085fd784b"},{"$oid":"63d19b900a55cd1085fd7847"},{"$oid":"63d1d398cf84b078575ab0fe"}]}
{"_id":{"$oid":"63d1d9eccf84b078575ab100"},"Title":"Pet Sematary","Summary":"Doctor Louis Creed (Dale Midkiff) moves his family to Maine, where he meets a friendly local named Jud Crandall (Fred Gwynne). After the Creeds' cat is accidentally killed, Crandall advises Louis to bury it in the ground near the old pet cemetery. The cat returns to life, its personality changed for the worse. When Louis' son, Gage (Miko Hughes), dies tragically, Louis decides to bury the boy's body in the same ground despite the warnings of Crandall and Louis' visions of a deceased patient.","filmPosterImg":"image.png","Director":{"$oid":"63d1a1b20a55cd1085fd7859"},"Genres":[{"$oid":"63d19d240a55cd1085fd784c"},{"$oid":"63d1d398cf84b078575ab0fe"}]}
{"_id":{"$oid":"63d1d9eccf84b078575ab101"},"Title":"Amelie","Summary":"Amélie\" is a fanciful comedy about a young woman who discretely orchestrates the lives of the people around her, creating a world exclusively of her own making. Shot in over 80 Parisian locations, acclaimed director Jean-Pierre Jeunet (\"Delicatessen\"; \"The City of Lost Children\") invokes his incomparable visionary style to capture the exquisite charm and mystery of modern-day Paris through the eyes of a beautiful ingenue.","filmPosterImg":"image.png","Director":{"$oid":"63d1a1b20a55cd1085fd7858"},"Genres":[{"$oid":"63d19d240a55cd1085fd784d"},{"$oid":"63d19da60a55cd1085fd784f"},{"$oid":"63d19da60a55cd1085fd784f"}]}
{"_id":{"$oid":"63d1d9eccf84b078575ab102"},"Title":"Full Metal Jacket","Summary":"Stanley Kubrick's take on the Vietnam War follows smart-aleck Private Davis (Matthew Modine), quickly christened \"Joker\" by his foul-mouthed drill sergeant (R. Lee Ermey), and pudgy Private Lawrence (Vincent D'Onofrio), nicknamed \"Gomer Pyle,\" as they endure the rigors of basic training. Though Pyle takes a frightening detour, Joker graduates to the Marine Corps and is sent to Vietnam as a journalist, covering -- and eventually participating in -- the bloody Battle of Hué.","filmPosterImg":"image.png","Director":{"$oid":"63d1a10b0a55cd1085fd7853"},"Genres":[{"$oid":"63d19b900a55cd1085fd7847"},{"$oid":"63d19da60a55cd1085fd784e"}]}
{"_id":{"$oid":"63d1d9eccf84b078575ab103"},"Title":"The Lost Boys","Summary":"The Lost Boys is a 1987 American supernatural black comedy horror film directed by Joel Schumacher, produced by Harvey Bernhard with a screenplay written by Jeffrey Boam, Janice Fischer and James Jeremias, from a story by Fischer and Jeremias.","filmPosterImg":"image.png","Director":{"$oid":"63d1a1b20a55cd1085fd7857"},"Genres":[{"$oid":"63d19d240a55cd1085fd784c"},{"$oid":"63d19da60a55cd1085fd784f"}]}
